#Generated by Fabric Compiler ( version 2020.3 <build 62942> ) at Thu Nov 10 10:11:26 2022

add_design "D:/DOING/00-GRAD/02-proj/07-FPGA_contest/UniRISCV_final/src/core_soc/core_soc.v"
add_design "D:/DOING/00-GRAD/02-proj/07-FPGA_contest/UniRISCV_final/src/riscv/riscv_exec.v"
add_design "D:/DOING/00-GRAD/02-proj/07-FPGA_contest/UniRISCV_final/src/src_v/tcm_mem_ram_old.v"
add_design "D:/DOING/00-GRAD/02-proj/07-FPGA_contest/UniRISCV_final/src/src_v/dport_mux.v"
add_design "D:/DOING/00-GRAD/02-proj/07-FPGA_contest/UniRISCV_final/src/riscv/riscv_csr.v"
add_design "D:/DOING/00-GRAD/02-proj/07-FPGA_contest/UniRISCV_final/src/core_soc/axi4lite_dist.v"
add_design "D:/DOING/00-GRAD/02-proj/07-FPGA_contest/UniRISCV_final/src/dbg_bridge/dbg_bridge_fifo.v"
add_design "D:/DOING/00-GRAD/02-proj/07-FPGA_contest/UniRISCV_final/src/riscv/riscv_core.v"
add_design "D:/DOING/00-GRAD/02-proj/07-FPGA_contest/UniRISCV_final/src/src_v/tcm_mem.v"
add_design "D:/DOING/00-GRAD/02-proj/07-FPGA_contest/UniRISCV_final/src/riscv/riscv_mmu.v"
add_design "D:/DOING/00-GRAD/02-proj/07-FPGA_contest/UniRISCV_final/src/riscv/riscv_lsu.v"
add_design "D:/DOING/00-GRAD/02-proj/07-FPGA_contest/UniRISCV_final/src/soc_tcm_single_uart.v"
add_design "D:/DOING/00-GRAD/02-proj/07-FPGA_contest/UniRISCV_final/src/dbg_bridge/dbg_bridge_uart.v"
add_design "D:/DOING/00-GRAD/02-proj/07-FPGA_contest/UniRISCV_final/src/src_v/dport_axi.v"
add_design "D:/DOING/00-GRAD/02-proj/07-FPGA_contest/UniRISCV_final/src/src_v/tcm_mem_ram.v"
add_design "D:/DOING/00-GRAD/02-proj/07-FPGA_contest/UniRISCV_final/src/core_soc/irq_ctrl.v"
add_design "D:/DOING/00-GRAD/02-proj/07-FPGA_contest/UniRISCV_final/src/riscv/riscv_pipe_ctrl.v"
add_design "D:/DOING/00-GRAD/02-proj/07-FPGA_contest/UniRISCV_final/src/riscv/riscv_alu.v"
add_design "D:/DOING/00-GRAD/02-proj/07-FPGA_contest/UniRISCV_final/src/src_v/tcm_mem_old.v"
add_design "D:/DOING/00-GRAD/02-proj/07-FPGA_contest/UniRISCV_final/src/core_soc/uart_lite.v"
add_design "D:/DOING/00-GRAD/02-proj/07-FPGA_contest/UniRISCV_final/src/core_soc/timer.v"
add_design "D:/DOING/00-GRAD/02-proj/07-FPGA_contest/UniRISCV_final/src/core_soc/spi_lite.v"
add_design "D:/DOING/00-GRAD/02-proj/07-FPGA_contest/UniRISCV_final/src/riscv/riscv_csr_regfile.v"
add_design "D:/DOING/00-GRAD/02-proj/07-FPGA_contest/UniRISCV_final/src/tb_tcm.v"
add_design "D:/DOING/00-GRAD/02-proj/07-FPGA_contest/UniRISCV_final/src/dbg_bridge/dbg_bridge.v"
add_design "D:/DOING/00-GRAD/02-proj/07-FPGA_contest/UniRISCV_final/src/riscv/riscv_issue.v"
add_design "D:/DOING/00-GRAD/02-proj/07-FPGA_contest/UniRISCV_final/src/riscv/riscv_multiplier.v"
add_design "D:/DOING/00-GRAD/02-proj/07-FPGA_contest/UniRISCV_final/src/src_v/tcm_mem_pmem.v"
add_design "D:/DOING/00-GRAD/02-proj/07-FPGA_contest/UniRISCV_final/src/riscv/riscv_regfile.v"
add_design "D:/DOING/00-GRAD/02-proj/07-FPGA_contest/UniRISCV_final/src/riscv/riscv_decode.v"
add_design "D:/DOING/00-GRAD/02-proj/07-FPGA_contest/UniRISCV_final/src/riscv/riscv_divider.v"
add_design "D:/DOING/00-GRAD/02-proj/07-FPGA_contest/UniRISCV_final/src/riscv/riscv_decoder.v"
add_design "D:/DOING/00-GRAD/02-proj/07-FPGA_contest/UniRISCV_final/src/source/soc_tcm.v"
add_design "D:/DOING/00-GRAD/02-proj/07-FPGA_contest/UniRISCV_final/src/riscv/riscv_fetch.v"
add_design "D:/DOING/00-GRAD/02-proj/07-FPGA_contest/UniRISCV_final/src/src_v/riscv_tcm_top.v"
add_design "D:/DOING/00-GRAD/02-proj/07-FPGA_contest/UniRISCV_final/src/core_soc/gpio.v"
remove_design -verilog "D:/DOING/00-GRAD/02-proj/07-FPGA_contest/UniRISCV_final/src/tb_tcm.v"
add_simulation "D:/DOING/00-GRAD/02-proj/07-FPGA_contest/UniRISCV_final/src/tb_tcm.v"
add_constraint "D:/DOING/00-GRAD/02-proj/07-FPGA_contest/UniRISCV_final/src/ubriscvOnPango.fdc"
remove_design -force -verilog "D:/DOING/00-GRAD/02-proj/07-FPGA_contest/UniRISCV_final/src/soc_tcm_single_uart.v"
remove_design -verilog "D:/DOING/00-GRAD/02-proj/07-FPGA_contest/UniRISCV_final/src/src_v/tcm_mem_ram_old.v"
add_design D:/DOING/00-GRAD/02-proj/07-FPGA_contest/UniRISCV_final/ipcore/BRAM/BRAM.idf
remove_design -verilog "D:/DOING/00-GRAD/02-proj/07-FPGA_contest/UniRISCV_final/src/src_v/tcm_mem_old.v"
remove_design -verilog "D:/DOING/00-GRAD/02-proj/07-FPGA_contest/UniRISCV_final/src/src_v/tcm_mem_ram.v"
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module soc_tcm
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_design D:/DOING/00-GRAD/02-proj/07-FPGA_contest/UniRISCV_final/ipcore/pll_v1/pll_v1.idf
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module soc_tcm
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module soc_tcm
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
pnr 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module soc_tcm
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module soc_tcm
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module soc_tcm
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module soc_tcm
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
